# St7GetNumTransientNodeHistoryCases

Returns the number of node history cases assigned for linear and nonlinear transient dynamic analysis.

long St7GetNumTransientNodeHistoryCases(long uID, long* NumCases)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumCases

Number of node history cases.